; domain
(define (domain blocks)
  (:requirements :strips :typing)
  (:types block 
          ;added
          colour
  )
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       
	       ;;added 
           (colour-of ?b - block ?c - colour)
	       (last-colour ?c - colour)
	       (handclean)
	       
	       )


   (:action clean
  :parameters(?c - colour)
  :precondition(and (handempty) (last-colour ?c))
  :effect(and 
  	(handclean) 
  	(not (last-colour ?c)))
   )	
	             
  (:action pick-up
	     :parameters (?x - block
                          ;added      
                          ?c - colour
	     )
	     :precondition (and (clear ?x) (ontable ?x) (handempty) 
                                ;;added
                                (colour-of ?x ?c)
                                (handclean)
	     )
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
  )
  
  (:action pick-up-same-colour
	     :parameters (?x - block
                          ;added      
                          ?c - colour
	     )
	     :precondition (and (clear ?x) (ontable ?x) (handempty) 
                                ;;added
                                (colour-of ?x ?c)
                                (last-colour ?c)
	     )
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
  )

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block ?c - colour)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty)
                                ;;added
                                (colour-of ?x ?c)
                                (handclean)
	     
	     )
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
    )
    
    (:action unstack-same-colour
	     :parameters (?x - block ?y - block ?c - colour)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty)
                                ;;added
                                (colour-of ?x ?c)
                                (last-colour ?c)    
	     
	     )
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))
                   ;;added
                   (not (handclean))
                   (last-colour ?c)
            )
		   
    ))

; problem
(define (problem sussman)
    (:domain blocks)
    (:objects
        a b c d - block
        
        ;;added
        red yellow - colour
    )
    (:init
        (on d c)
        (clear d)
        (ontable a)
        (ontable b)
        (ontable c)
        (clear b)
        (clear a)
        (handempty)
        
        ;;added
        (colour-of a yellow)
        (colour-of b red)
        (colour-of c red)
        (colour-of d yellow)
        
        (handclean)
    
    )
    (:goal (and
    
    (on c d)
    (on b c)
    (on a b)
    ))
)

; plan
1. (pick-up a yellow)
   deleted: (ontable a) (clear a) (handempty) (handclean)
   added: (holding a) (last-colour yellow)
   goals met: 0 of 3
2. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 1 of 3
3. (unstack-same-colour d c yellow)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 1 of 3
4. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 1 of 3
5. (clean yellow)
   deleted: (last-colour yellow)
   added: (handclean)
   goals met: 1 of 3
6. (pick-up c red)
   deleted: (ontable c) (clear c) (handempty) (handclean)
   added: (holding c) (last-colour red)
   goals met: 1 of 3
7. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 2 of 3
8. (clean red)
   deleted: (last-colour red)
   added: (handclean)
   goals met: 2 of 3
9. (unstack a b yellow)
   deleted: (clear a) (handempty) (on a b) (handclean)
   added: (holding a) (clear b) (last-colour yellow)
   goals met: 1 of 3
10. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 1 of 3
11. (clean yellow)
   deleted: (last-colour yellow)
   added: (handclean)
   goals met: 1 of 3
12. (pick-up b red)
   deleted: (ontable b) (clear b) (handempty) (handclean)
   added: (holding b) (last-colour red)
   goals met: 1 of 3
13. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 2 of 3
14. (clean red)
   deleted: (last-colour red)
   added: (handclean)
   goals met: 2 of 3
15. (pick-up a yellow)
   deleted: (ontable a) (clear a) (handempty) (handclean)
   added: (holding a) (last-colour yellow)
   goals met: 2 of 3
16. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 3 of 3
